# IsValidValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDoubleArray3d..::..IsValidValue Method
AssetPropertyDoubleArray3d Class See Also
---
Checks that the value is a valid value for this property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public bool IsValidValue(
	XYZ xyz
)
```

Visual Basic
---
```text
Public Function IsValidValue ( _
	xyz As XYZ _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidValue(
	XYZ^ xyz
)
```

# ### Parameters
xyz
    Type: Autodesk.Revit.DB..::..XYZ The value to be checked.
# ### Return Value
True if the value is valid for the property.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Cannot check validity for a property not being edited in AppearanceAssetEditScope. |

# See Also
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace